app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Michael's Great Adventures"], ["created_at", "2023-09-11 23:16:16.507113"], ["updated_at", "2023-09-11 23:16:16.507113"], ["author", "Michael Ramirez"], ["price", "25.99"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "updated_at" = $1, "publishdate" = $2 WHERE "books"."id" = $3  [["updated_at", "2023-09-11 23:42:46.083470"], ["publishdate", "2993-09-05"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)